Repository: Acidburn0zzz/live-debconfig
Catalog: manpages/po/*/live-debconfig_hostname.5.po
Languages: ca

source: Debian Live Project
ca: Projecte Debian Live

source: NAME
ca: NOM

source: DESCRIPTION
ca: DESCRIPCIÓ

source: B<live-debconfig> contains the scripts that configure a Debian Live system during the build process (live-build).
ca: B<live-debconfig> conté els scripts que configuren un sistema Debian Live durant el procés de construcció (live-build).

source: SEE ALSO
ca: VEURE TAMBÉ

source: HOMEPAGE
ca: PÀGINA WEB

source: More information about live-debconfig and the Debian Live project can be found on the homepage at E<lt>I<http://live.debian.net/>E<gt> and in the manual at E<lt>I<http://live.debian.net/manual/>E<gt>.
ca: Es pot trobar més informació sobre live-debconfig i el projecte Debian Live a la pàgina web E<lt>I<http://live.debian.net/>E<gt> i al manual a E<lt>I<http://live.debian.net/manual/>E<gt>.

source: BUGS
ca: ERRORS

source: Bugs can be reported by submitting a bugreport for the live-debconfig package in the Debian Bug Tracking System at E<lt>I<http://bugs.debian.org/>E<gt> or by writing a mail to the Debian Live mailing list at E<lt>I<debian-live@lists.debian.org>E<gt>.
ca: Es pot informar sobre els errors mitjançant la presentació d'un informe d'errors sobre al paquet live-debconfig al Debian Bug Tracking System a E<lt>I<http://bugs.debian.org/>E<gt> o escrivint un correu a la llista de correu de Debian Live a E<lt>I<debian-live@lists.debian.org>E<gt>.

source: AUTHOR
ca: AUTOR

source: live-debconfig was written by Daniel Baumann E<lt>I<daniel@debian.org>E<gt>.
ca: live-debconfig va ser escrit per Daniel Baumann E<lt>I<daniel@debian.org>E<gt>.

source: B<live-debconfig> - hostname script
ca: B<live-debconfig> - script hostname

source: This script sets the systems hostname in the /etc/hostname file.
ca: Aquest script estableix el nom del amfitrió del sistema al fitxer /etc/hostname

source: PRESEEDING
ca: PRECONFIGURACIÓ

source: The hostname script currently features the following preseeding options.
ca: El script hostname actualment inclou les opcions de preconfiguració següents.

source: Allows to set the hostname of the system.
ca: Permet establir el nom d'amfitrió del sistema.

source: If no value is preseeded, a suitable default is being suggested in a debconf prompt. If no value is entered in the debconf prompt, the default value is being used. The default value is determined automatically:
ca: Si no hi ha cap valor preconfigurat, es suggereix un valor per defecte en un prompt de debconf. Si no s'introdueix cap valor al prompt de debconf, s'utilitza el valor per defecte. El valor per defecte es determina de forma automàtica:

source: 1. I<HOSTNAME> is set to the string in the /etc/hostname file, if existing and non-empty.
ca: 1. I<HOSTNAME> s'estableix al fitxer /etc/hostname si existeix i no és buit.

source: 2. I<HOSTNAME> is set to the distributor's ID as in the /etc/os-release file, if existing and non-empty.
ca: 2. I<HOSTNAME> s'estableix a l'ID del distribuïdor, com al fitxer /etc/os-release, si existeix i no és buit.

source: 3. I<HOSTNAME> is set to the distributor's ID as in the I<lsb_release>(1) program, if installed and non-empty.
ca: 3. I<HOSTNAME> s'estableix a l'ID del distribuïdor, com al programa I<lsb_release>(1) si està instaŀlat in no és buit.

source: 4. I<HOSTNAME> is set to B<progress-linux> if the /etc/progress-linux_version file is existing.
ca: 4. I<HOSTNAME> s'estableix a B<progress-linux> si existeix el fitxer /etc/progress-linux_version

source: 5. I<HOSTNAME> is set to B<debian> as a fallback.
ca: 5. I<HOSTNAME> s'estableix a B<debian> com a forma alternativa.

source: B<Warning:> the new hostname will be set in the /etc/hostname file, overwriting any previous content without prior prompt or backup.
ca: B<Advertència:> el nou nom d'amfitrió s'afegirà al fitxer /etc/hostname sobreescrivint qualsevol contingut anterior sense previ avís o còpia de seguretat.
